app/views/commons/_article.html.haml

  = link_to account_path(article.user), class: 'f-container' do
    - if article.user&.avatar&.present?
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]