app/controllers/articles_controller.rb

INSERT INTO "articles" ("user_id", "title", "content", "image", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 1], ["title", "gagara"], ["content", "hhasgah"], ["image", "1610685329502-U722iCSMM5.jpeg"], ["created_at", "2021-04-08 15:43:25.176202"], ["updated_at", "2021-04-08 15:43:25.176202"]]
---
  def create
    @article = current_user.articles.build(article_params)
    if @article.save